# Essential Functionality

Going throught the fundamentals of interacting with data

In [88]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

___
## Reindexing

means to create a new object but conforming to a new index

In [89]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [90]:
obj2 = obj.reindex(['a', 'b', 'c', 'd','e']) # will show missing values if a new index doesn't have a value
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [91]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

*method* allows you to fill in missing values

In [92]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

*reindex* can also alter the row (index), columns, or both. If you are passing one sequece, it will reindex the rows. If you pass two sequences, it will reindex the columns.

In [93]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [94]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [95]:
states = ['Texas', 'Utah', 'California']

frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### reindex function arguments

* **index:** New sequence to use as index. Can be Index instance or any other sequence-like Python data structure. An
Index will be used exactly as is without any copying.
* **method:** Interpolation (fill) method; 'ffill' fills forward, while 'bfill' fills backward.
* **fill_value:** Substitute value to use when introducing missing data by reindexing.
* **limit:** When forward- or backfilling, maximum size gap (in number of elements) to fill.
* **tolerance:** When forward- or backfilling, maximum size gap (in absolute numeric distance) to fill for inexact matches.
* **level:** Match simple Index on level of MultiIndex; otherwise select subset of.
* **copy:** If True, always copy underlying data even if new indez is equivalent to old index; if False, do not copy
the data when the indexes are equivalent

___
## Dropping Entries from an Axis

*drop* method will drop entries from an axis. it will return a copy but will not affect the original object.

In [96]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [97]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [98]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, you can drop rows or columns by passing the name of the row or column you want to drop.

In [99]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can also drop by passing axis labels.

In [101]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [102]:
data.drop(['two','four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

When setting in-place=True, the operation will modify the original object.

In [103]:
obj.drop('c', inplace=True)

In [104]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

___
## Indexing, Selection, and Filtering

Series indexing works with the same syntax as with NumPy arrays.

In [105]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [106]:
obj['b']

1.0

In [107]:
obj[1]

C:\Users\ivane\AppData\Local\Temp\ipykernel_12952\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [108]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [109]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [110]:
obj[[1,3]]

C:\Users\ivane\AppData\Local\Temp\ipykernel_12952\1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [111]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [112]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [113]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing a DataFrame is for retrieving a subset of the data. It could be a single column, a list of columns, or a 2D slice.

In [114]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [115]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [116]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [117]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [118]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Can also index with a boolean DataFrame

In [119]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [120]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selecting with loc and iloc

They enable you to select rows and columns by label or by position. Loc selects by label and iloc by position with integers.

In [121]:
data.loc['Colorado', ['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [122]:
data.iloc[2, [3, 0, 1]] # selecting by position with integers

four    11
one      8
two      9
Name: Utah, dtype: int32

In [123]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [124]:
data.iloc[[1,2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both funcitons work with slice objects.

In [125]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [126]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Indexing options with DataFrame

* **df[val]:** Select single column or sequence of columns from the DataFrame; special case
conveniences: boolean array (filter rows), slice (slice rows), or boolean DataFrame
(set values based on some criterion)
* **df.loc[val]:** Selects single row or subset of rows from the DataFrame by label
* **df.loc[:, val]:** Selects single column or subset of columns by label
* **df.loc[val1, val2]:** Select both rows and columns by label
* **df.iloc[where]:** Selects single row or subset of rows from the DataFrame by integer position
* **df.iloc[:, where]:** Selects single column or subset of columns by integer position
* **df.iloc[where_i, where_j]:** Select both rows and columns by integer position
* **df.at[label_i, label_j]:** Select a single scalar value by row and column label
* **df.iat[i, j]:** Select a single scalar value by row and column position (integers)
* **reindex method:** Select either rows or columns by labels
* **get_value, set_value methods:** Select single value by row and column label

___
## Integer Indexes

In [127]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [128]:
ser[-1]

KeyError: -1

In [ ]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [ ]:
ser2[-1]

C:\Users\ivane\AppData\Local\Temp\ipykernel_12952\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

loc is used to select by label, while iloc is used to select by position.

This uses integer-based indexing ([:1]) to select the first element (index 0) of the Series. It returns:

In [ ]:
ser[:1]

0    0.0
dtype: float64

In the case where you have no custom labels assigned to the Series (as in your original code), ser.loc[:1] behaves the same as integer-based indexing because it defaults to using integer positions. It selects the first element (index 0):

In [ ]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

This uses integer-based indexing again ([:1]). It selects the element at index 0, resulting in:

In [ ]:
ser.iloc[:1]

0    0.0
dtype: float64

___
## Arithmetic and Data Alignment

In SQL terms, this is like doing a simple join on two tables.

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [ ]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [ ]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In the case of DataFrame, alignment is performed on both the rows and the columns:

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                    index=['Ohio', 'Texas', 'Colorado'])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [ ]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Result will contain nulls if columns and index do not match

In [ ]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

If you add DataFrame objects with no common rows or column labels, you will get null values

In [ ]:
df1 = pd.DataFrame({'A': [1, 2]})

df2 = pd.DataFrame({'B': [3, 4]})

In [ ]:
df1

   A
0  1
1  2

In [ ]:
df2

   B
0  3
1  4

In [ ]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

Sometimes, you may want to fill in missing values with a special value, such as 0 when a label is not found.

In [ ]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [ ]:
df2.loc[1, 'b'] = np.nan

In [ ]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [ ]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

add method was used to fill in missing values with 0.

In [ ]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [ ]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [ ]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Flexibile arithmetic methods

* **add, radd:** Methods for addition (+)
* **sub, rsub:** Methods for subtraction (-)
* **div, rdiv:** Methods for division (/)
* **floordiv, rfloordiv:** Methods for floor division (//)
* **mul, rmul:** Methods for multiplication (**)

### Operations with Series and DataFrame

Consider the following difference between a two-dimensional array and one of its rows

In [ ]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [ ]:
arr[0]

array([0, 1, 2, 3])

In [ ]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

As we can see, subtraction is performing element-wise (once for each row). This is also known as broadcasting. Operations between Series and DataFrame are similar.

In [ ]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

series = frame.iloc[0]

In [ ]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [ ]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an index value is not found in either the DataFrame’s columns or the Series’s index,
the objects will be reindexed to form the union

In [ ]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [ ]:
series2

b    0
e    1
f    2
dtype: int64

In [ ]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If you want to instead broadcast over the columns, matching on the rows, you have to
use one of the arithmetic methods. For example

In [ ]:
series3 = frame['d']

frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [ ]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [ ]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0